app/controllers/api/cities_controller.rb

  def index
    render json: { cities: City.all }
---
SELECT "cities".* FROM "cities"

  def create
    new_city = City.create city_params
---
INSERT INTO "cities" ("name", "visited", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Fuckkkk"], ["visited", "t"], ["created_at", "2016-05-22 20:02:39.711986"], ["updated_at", "2016-05-22 20:02:39.711986"]]

  def update
    update_city = City.find params[:id]
    update_city.update city_params
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 17]]
UPDATE "cities" SET "image" = $1, "visited" = $2, "updated_at" = $3 WHERE "cities"."id" = $4  [["image", "http://23.229.189.65/wp-content/uploads/2014/08/boston.jpg"], ["visited", "t"], ["updated_at", "2016-05-31 19:36:30.027819"], ["id", 4]]

  def destroy
    destroy_city = City.find params[:id]
    destroy_city.destroy
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 2]]